In [3]:
from pyspark.sql import SparkSession

In [4]:
spark = SparkSession.builder.appName("PySpark SQL").getOrCreate()

spark.sparkContext.setLogLevel("ERROR")

25/07/04 00:08:55 WARN Utils: Your hostname, Anirbans-MacBook-Pro.local resolves to a loopback address: 127.0.0.1; using 192.168.0.149 instead (on interface en0)
25/07/04 00:08:55 WARN Utils: Set SPARK_LOCAL_IP if you need to bind to another address
Setting default log level to "WARN".
To adjust logging level use sc.setLogLevel(newLevel). For SparkR, use setLogLevel(newLevel).
25/07/04 00:08:56 WARN NativeCodeLoader: Unable to load native-hadoop library for your platform... using builtin-java classes where applicable

In [3]:
#Create spark DataFrames from RDD
iphones_RDD = spark.sparkContext.parallelize([
("XS", 2018, 5.65, 2.79, 6.24),
("XR", 2018, 5.94, 2.98, 6.84),
("X10", 2017, 5.65, 2.79, 6.13),
("8Plus", 2017, 6.23, 3.07, 7.12)
])

In [4]:
df_schema = ["Model","Year","Height","Width","Weight"]

In [5]:
df = spark.createDataFrame(iphones_RDD,df_schema)

In [6]:
df.toPandas()

   Model  Year  Height  Width  Weight
0     XS  2018    5.65   2.79    6.24
1     XR  2018    5.94   2.98    6.84
2    X10  2017    5.65   2.79    6.13
3  8Plus  2017    6.23   3.07    7.12

In [7]:
# Create an DataFrame from file_path
people_df = spark.read.csv("people.csv", header=True, inferSchema=True)

# Check the type of people_df
print("The type of people_df is", type(people_df))

The type of people_df is <class 'pyspark.sql.dataframe.DataFrame'>

In [8]:
people_df.show(10)

+---+---------+----------------+------+-------------------+
|_c0|person_id|            name|   sex|      date of birth|
+---+---------+----------------+------+-------------------+
|  0|      100|  Penelope Lewis|female|1990-08-31 00:00:00|
|  1|      101|   David Anthony|  male|1971-10-14 00:00:00|
|  2|      102|       Ida Shipp|female|1962-05-24 00:00:00|
|  3|      103|    Joanna Moore|female|2017-03-10 00:00:00|
|  4|      104|  Lisandra Ortiz|female|2020-08-05 00:00:00|
|  5|      105|   David Simmons|  male|1999-12-30 00:00:00|
|  6|      106|   Edward Hudson|  male|1983-05-09 00:00:00|
|  7|      107|    Albert Jones|  male|1990-09-13 00:00:00|
|  8|      108|Leonard Cavender|  male|1958-08-08 00:00:00|
|  9|      109|  Everett Vadala|  male|2005-05-24 00:00:00|
+---+---------+----------------+------+-------------------+
only showing top 10 rows

In [9]:
people_df.columns

['_c0', 'person_id', 'name', 'sex', 'date of birth']

In [10]:
names_df = people_df.select("name").show()

+-----------------+
|             name|
+-----------------+
|   Penelope Lewis|
|    David Anthony|
|        Ida Shipp|
|     Joanna Moore|
|   Lisandra Ortiz|
|    David Simmons|
|    Edward Hudson|
|     Albert Jones|
| Leonard Cavender|
|   Everett Vadala|
| Freddie Claridge|
|Annabelle Rosseau|
|    Eulah Emanuel|
|       Shaun Love|
|Alejandro Brennan|
|Robert Mcreynolds|
|   Carla Spickard|
|Florence Eberhart|
|     Tina Gaskins|
| Florence Mulhern|
+-----------------+
only showing top 20 rows

In [11]:
# Select name, sex and date of birth columns
people_df_sub = people_df.select('name', 'sex', 'date of birth')

In [12]:
# Print the first 10 observations from people_df_sub
people_df_sub.show(10)

+----------------+------+-------------------+
|            name|   sex|      date of birth|
+----------------+------+-------------------+
|  Penelope Lewis|female|1990-08-31 00:00:00|
|   David Anthony|  male|1971-10-14 00:00:00|
|       Ida Shipp|female|1962-05-24 00:00:00|
|    Joanna Moore|female|2017-03-10 00:00:00|
|  Lisandra Ortiz|female|2020-08-05 00:00:00|
|   David Simmons|  male|1999-12-30 00:00:00|
|   Edward Hudson|  male|1983-05-09 00:00:00|
|    Albert Jones|  male|1990-09-13 00:00:00|
|Leonard Cavender|  male|1958-08-08 00:00:00|
|  Everett Vadala|  male|2005-05-24 00:00:00|
+----------------+------+-------------------+
only showing top 10 rows

In [13]:
# Remove duplicate entries from people_df_sub
people_df_sub_nodup = people_df_sub.dropDuplicates()

In [14]:
# Count the number of rows
print("There were {} rows before removing duplicates, and {} rows \
after removing duplicates".format(people_df_sub.count(), people_df_sub_nodup.count()))

There were 100000 rows before removing duplicates, and 99998 rows after removing duplicates

In [15]:
# Filter people_df to select females 
people_df_female = people_df.filter(people_df.sex == "female")

In [16]:
people_df_female.show()

+---+---------+-----------------+------+-------------------+
|_c0|person_id|             name|   sex|      date of birth|
+---+---------+-----------------+------+-------------------+
|  0|      100|   Penelope Lewis|female|1990-08-31 00:00:00|
|  2|      102|        Ida Shipp|female|1962-05-24 00:00:00|
|  3|      103|     Joanna Moore|female|2017-03-10 00:00:00|
|  4|      104|   Lisandra Ortiz|female|2020-08-05 00:00:00|
| 11|      111|Annabelle Rosseau|female|1989-07-13 00:00:00|
| 12|      112|    Eulah Emanuel|female|1976-01-19 00:00:00|
| 16|      116|   Carla Spickard|female|1985-06-13 00:00:00|
| 17|      117|Florence Eberhart|female|2024-06-01 00:00:00|
| 18|      118|     Tina Gaskins|female|1966-12-05 00:00:00|
| 19|      119| Florence Mulhern|female|1959-05-31 00:00:00|
| 21|      121|    Evelyn Kriner|female|1978-09-16 00:00:00|
| 22|      122|     Heather Luce|female|2012-02-24 00:00:00|
| 26|      126|      Marion Baca|female|1948-03-04 00:00:00|
| 27|      127|       Devona Kay|female|2009-12-30 00:00:00|
| 28|      128|   Betty Endicott|female|1992-05-01 00:00:00|
| 30|      130|        Jane Ross|female|1965-09-12 00:00:00|
| 34|      134|   Pauline Steele|female|1969-10-18 00:00:00|
| 35|      135|     Anne Novotny|female|1936-02-18 00:00:00|
| 37|      137|      Carol Noble|female|1997-02-11 00:00:00|
| 38|      138| Constance Fulmer|female|2004-03-07 00:00:00|
+---+---------+-----------------+------+-------------------+
only showing top 20 rows

In [17]:
# Filter people_df to select males
people_df_male = people_df.filter(people_df.sex == "male").show()

+---+---------+-------------------+----+-------------------+
|_c0|person_id|               name| sex|      date of birth|
+---+---------+-------------------+----+-------------------+
|  1|      101|      David Anthony|male|1971-10-14 00:00:00|
|  5|      105|      David Simmons|male|1999-12-30 00:00:00|
|  6|      106|      Edward Hudson|male|1983-05-09 00:00:00|
|  7|      107|       Albert Jones|male|1990-09-13 00:00:00|
|  8|      108|   Leonard Cavender|male|1958-08-08 00:00:00|
|  9|      109|     Everett Vadala|male|2005-05-24 00:00:00|
| 10|      110|   Freddie Claridge|male|2002-05-07 00:00:00|
| 13|      113|         Shaun Love|male|1970-05-26 00:00:00|
| 14|      114|  Alejandro Brennan|male|1980-12-22 00:00:00|
| 15|      115|  Robert Mcreynolds|male|1973-12-27 00:00:00|
| 20|      120|         Joel Smith|male|1996-08-13 00:00:00|
| 23|      123|        Angel Moher|male|2017-12-22 00:00:00|
| 24|      124|    Charles Leonard|male|1972-03-09 00:00:00|
| 25|      125|        Mark Miller|male|1976-05-11 00:00:00|
| 29|      129|       David Bishop|male|1960-10-18 00:00:00|
| 31|      131|      Joseph Windus|male|2029-05-27 00:00:00|
| 32|      132|Christopher Gilbert|male|2010-09-21 00:00:00|
| 33|      133|   Robert Salisbury|male|1965-06-22 00:00:00|
| 36|      136|      Wilbert Glass|male|1976-10-10 00:00:00|
| 40|      140|          Juan Dunn|male|1969-10-06 00:00:00|
+---+---------+-------------------+----+-------------------+
only showing top 20 rows

In [18]:
people_df.createOrReplaceTempView("people")

In [19]:
# Filter the people table to select female sex 
people_female_df = spark.sql('SELECT * FROM people WHERE sex="female"')

In [20]:
# Filter the people table DataFrame to select male sex
people_male_df = spark.sql('SELECT * FROM people WHERE sex=="male"')

In [21]:
# Count the number of rows in both people_df_female and people_male_df DataFrames
print("There are {} rows in the people_female_df and {} rows in the people_male_df DataFrames".format(people_female_df.count(), people_male_df.count()))

There are 49014 rows in the people_female_df and 49066 rows in the people_male_df DataFrames

In [22]:
# Check the column names of names_df
names_df = spark.sql('''
                        SELECT name,
                                year(current_date()) - year(`date of birth`) AS age
                        FROM people
                        '''
                    )

In [23]:
names_df.show()

+-----------------+---+
|             name|age|
+-----------------+---+
|   Penelope Lewis| 35|
|    David Anthony| 54|
|        Ida Shipp| 63|
|     Joanna Moore|  8|
|   Lisandra Ortiz|  5|
|    David Simmons| 26|
|    Edward Hudson| 42|
|     Albert Jones| 35|
| Leonard Cavender| 67|
|   Everett Vadala| 20|
| Freddie Claridge| 23|
|Annabelle Rosseau| 36|
|    Eulah Emanuel| 49|
|       Shaun Love| 55|
|Alejandro Brennan| 45|
|Robert Mcreynolds| 52|
|   Carla Spickard| 40|
|Florence Eberhart|  1|
|     Tina Gaskins| 59|
| Florence Mulhern| 66|
+-----------------+---+
only showing top 20 rows

In [24]:
people_df_sub_nodup.printSchema()

root
 |-- name: string (nullable = true)
 |-- sex: string (nullable = true)
 |-- date of birth: timestamp (nullable = true)

In [25]:
# Check the column names of names_df
print("The column names of names_df are", names_df.columns)

The column names of names_df are ['name', 'age']

In [26]:
# Convert to Pandas DataFrame  
df_pandas = names_df.toPandas()

df_pandas

                   name  age
0        Penelope Lewis   35
1         David Anthony   54
2             Ida Shipp   63
3          Joanna Moore    8
4        Lisandra Ortiz    5
...                 ...  ...
99995     Annette Jones   24
99996      Angela Meyer   45
99997       Janet Brann   34
99998  Melanie Kendrick   47
99999      James Grappe   25

[100000 rows x 2 columns]

In [ ]:
from matplotlib import pyplot as plt

#Plot histogram based
df_pandas.plot(kind='barh',x='name',y='age')

In [ ]:
# Load the Dataframe
file_path = "Fifa2018_dataset.csv"
fifa_df = spark.read.csv(file_path, header=True, inferSchema=True)

# Check the schema of columns
fifa_df.printSchema()

# Show the first 10 observations
print(fifa_df.limit(10).toPandas())

# Print the total number of rows
print("There are {} rows in the fifa_df DataFrame".format(fifa_df.count()))

In [5]:
spark.stop()